In [2]:
import pandas as pd
import numpy as np

In [3]:
my_dictionary = {"James" : [40,30,np.nan], "Kirk" : [20,np.nan,50], "Lars" : [30,50,40]}

In [4]:
my_dictionary

{'James': [40, 30, nan], 'Kirk': [20, nan, 50], 'Lars': [30, 50, 40]}

In [5]:
my_data_frame = pd.DataFrame(my_dictionary)

In [6]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [7]:
my_data_frame.dropna()

   James  Kirk  Lars
0   40.0  20.0    30

In [8]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [9]:
my_data_frame.dropna(axis=1)

   Lars
0    30
1    50
2    40

In [13]:
my_new_dictionary = {"James" : [40,30,np.nan], "Kirk" : [20,np.nan,50], "Lars" : [30,50,40], "Rob" : [40,np.nan,np.nan]}

In [14]:
my_new_data_frame = pd.DataFrame(my_new_dictionary)

In [15]:
my_new_data_frame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  40.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [16]:
my_new_data_frame.dropna(axis=1, thresh=2)

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [17]:
my_new_data_frame.dropna(axis=1, thresh=3)

   Lars
0    30
1    50
2    40

In [18]:
my_new_data_frame.dropna(axis=1, thresh=4)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [19]:
my_new_data_frame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  40.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [21]:
my_new_data_frame.fillna(99)

   James  Kirk  Lars   Rob
0   40.0  20.0    30  40.0
1   30.0  99.0    50  99.0
2   99.0  50.0    40  99.0

In [22]:
#groupby

In [37]:
salary_dict = {"Programing Language" : ["Python","Python","Python","Java","Java","Swift"], "Name" : ["A","B","C","D","E","F"], "Salary" : [100,90,80,70,60,50]}

In [38]:
salary_dict

{'Programing Language': ['Python',
  'Python',
  'Python',
  'Java',
  'Java',
  'Swift'],
 'Name': ['A', 'B', 'C', 'D', 'E', 'F'],
 'Salary': [100, 90, 80, 70, 60, 50]}

In [39]:
salary_frame = pd.DataFrame(salary_dict)

In [40]:
salary_frame

  Programing Language Name  Salary
0              Python    A     100
1              Python    B      90
2              Python    C      80
3                Java    D      70
4                Java    E      60
5               Swift    F      50

In [41]:
salary_frame.groupby("Programing Language")

In [42]:
group_object = salary_frame.groupby("Programing Language")

In [43]:
group_object.count()

                     Name  Salary
Programing Language
Java                    2       2
Python                  3       3
Swift                   1       1

In [46]:
group_object.mean("Salary")

                     Salary
Programing Language
Java                   65.0
Python                 90.0
Swift                  50.0

In [47]:
group_object.min()

                    Name  Salary
Programing Language
Java                   D      60
Python                 A      80
Swift                  F      50

In [48]:
group_object.max()

                    Name  Salary
Programing Language
Java                   E      70
Python                 C     100
Swift                  F      50

In [49]:
group_object.min("Salary")

                     Salary
Programing Language
Java                     60
Python                   80
Swift                    50

In [51]:
group_object.min(numeric_only = True)

                     Salary
Programing Language
Java                     60
Python                   80
Swift                    50

In [52]:
group_object.describe()

                    Salary
                     count  mean        std   min   25%   50%   75%    max
Programing Language
Java                   2.0  65.0   7.071068  60.0  62.5  65.0  67.5   70.0
Python                 3.0  90.0  10.000000  80.0  85.0  90.0  95.0  100.0
Swift                  1.0  50.0        NaN  50.0  50.0  50.0  50.0   50.0

In [53]:
my_dict1 = { "Name" : ["A", "B", "C", "D"],
             "Sport" : ["Basketball", "Football", "Tennis", "Running"],
             "Calories" : [100, 200, 300, 400]
           }

In [65]:
my_frame1 = pd.DataFrame(my_dict1, index= [0,1,2,3])

In [66]:
my_frame1

  Name       Sport  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [67]:
my_dict2 = { "Name" : ["E", "F", "G", "H"],
             "Sport" : ["Basketball", "Football", "Tennis", "Running"],
             "Calories" : [200, 50, 330, 440]
           }

In [68]:
my_frame2 = pd.DataFrame(my_dict2, index=[4,5,6,7])

In [69]:
my_frame2

  Name       Sport  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       330
7    H     Running       440

In [70]:
my_dict3 = { "Name" : ["I", "J", "K", "L"],
             "Sport" : ["Basketball", "Football", "Tennis", "Running"],
             "Calories" : [300, 150, 320, 410]
           }

In [75]:
my_frame3 = pd.DataFrame(my_dict3, index=[8,9,10,11])

In [76]:
my_frame3

   Name       Sport  Calories
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L     Running       410

In [77]:
#concatenation

In [78]:
pd.concat([my_frame1, my_frame2, my_frame3])

   Name       Sport  Calories
0     A  Basketball       100
1     B    Football       200
2     C      Tennis       300
3     D     Running       400
4     E  Basketball       200
5     F    Football        50
6     G      Tennis       330
7     H     Running       440
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L     Running       410

In [79]:
#merge

In [81]:
pd.merge(my_frame1, my_frame2, on="Sport")

  Name_x       Sport  Calories_x Name_y  Calories_y
0      A  Basketball         100      E         200
1      B    Football         200      F          50
2      C      Tennis         300      G         330
3      D     Running         400      H         440

In [82]:
new_salary_frame = pd.DataFrame({"Name" : ["James", "Kirk","Lars"],
                                 "Salary" : [10, 20, 30],
                                 "Age" : [60,65,70]})

In [83]:
new_salary_frame

    Name  Salary  Age
0  James      10   60
1   Kirk      20   65
2   Lars      30   70

In [84]:
new_salary_frame["Name"]

0    James
1     Kirk
2     Lars
Name: Name, dtype: object

In [85]:
new_salary_frame["Name"].unique()

array(['James', 'Kirk', 'Lars'], dtype=object)

In [86]:
new_salary_frame["Name"].nunique()

3

In [89]:
def grossToNet(salary):
    return salary *0.65

In [90]:
new_salary_frame["Salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: Salary, dtype: float64